kittiphun-rut/IV-Monitor-BCNPH/firmware/ESP32-S3-Host-TFT-V_4_8_0/ESP32-S3-Host-TFT-V_4_8_0.ino
int bedMinutesLeft(int i) {
  const StationData &s = stations[i];
  if (s.cfg.planVolumeMl <= 0 || !isStationOnline(i) || !s.isRunning) return -1;
  if (s.alertCode == ALERT_OCCLUSION) return -1;   // สายพับ/ไม่มีการไหล คำนวณเวลาที่เหลือไม่ได้
  float left = s.cfg.planVolumeMl - s.totalVolumeMl;
  if (left < 0) left = 0;
  float rate = (s.flowRate_ml_hr > 5.0f) ? s.flowRate_ml_hr : s.cfg.targetRateHr;
  if (rate <= 0) return -1;
  return (int)((left / rate) * 60.0f);
}

// เตียงที่ควรถูกเน้น: เหตุวิกฤตมาก่อน ตามด้วยใกล้หมดถุง ไม่มีเลยจึงใช้เตียงที่ผู้ใช้เลือกไว้
int autoFocusBed() {
  for (int i = 0; i < activeStationCount; i++) if (bedIsAlarm(bedUiStatus(i))) return i;
  for (int i = 0; i < activeStationCount; i++)
    if (stations[i].alertCode == ALERT_NEAR_END && !stations[i].nearEndAck) return i;
  return -1;
}

int currentFocusBed() {
  int a = autoFocusBed();
  if (a >= 0) return a;
  if (manualFocusBed >= 0 && manualFocusBed < activeStationCount) return manualFocusBed;
  return 0;
}

// ---------------------------------------------------------------- ผังหน้าจอ
#define SCR_W       320
#define SCR_H       240
#define TOPBAR_H    24
#define PANEL_X     5
#define PANEL_Y     30
#define PANEL_W     190
#define PANEL_H     188
#define SIDE_X      200
#define SIDE_W      115
#define BOTBAR_Y    222
#define BOTBAR_H    18

void resetUiCaches() {
  cacheClock = ""; cacheTopRight = ""; cacheFocusHead = ""; cacheStatusWord = "";
  cacheRate = ""; cacheSetRate = ""; cacheSummary = ""; cacheBottom = ""; cacheAlarmRate = "";
  cachePct = -999;
  for (int i = 0; i < MAX_SUPPORTED_STATIONS; i++) cacheSide[i] = "";
  uiFocusDrawn = -1;
  uiRowsDrawn = -1;
}

// ---- แถบบนสุด: ชื่อเครื่อง | นาฬิกา | จำนวนเครื่องที่ต่อ Wi-Fi + แบตเตอรี่ ----
void drawTopBarFramework() {
  tft.fillRect(0, 0, SCR_W, TOPBAR_H, C_TOPBAR);
  tft.fillRect(0, TOPBAR_H, SCR_W, 2, C_LINE);
  textAt("SMART IV HOST", 8, 8, 1, C_SKY, C_TOPBAR);
}

void updateTopBar() {
  String clockStr = getDisplayClockStr();
  if (clockStr != cacheClock) {
    cacheClock = clockStr;
    textCenterIn(clockStr, 0, SCR_W, 6, 2, isTimeApprox ? C_YELLOW : C_WHITE, C_TOPBAR);
  }
  String right = String(WiFi.softAPgetStationNum()) + ":" + String(hostBatteryPct / 5);
  if (right != cacheTopRight) {
    cacheTopRight = right;
    drawWifiIcon(SCR_W - 52, 6, (int)WiFi.softAPgetStationNum());
    drawBatteryIcon(SCR_W - 30, 7, hostBatteryPct);
  }
}

// ---- แถบสรุปเหตุการณ์ด้านล่าง ----
void updateBottomBar() {
  int alarm = -1, near = -1;
  for (int i = 0; i < activeStationCount; i++) {
    if (alarm < 0 && bedIsAlarm(bedUiStatus(i))) alarm = i;
    if (near < 0 && stations[i].alertCode == ALERT_NEAR_END && !stations[i].nearEndAck) near = i;
  }
  int online = 0;
  for (int i = 0; i < activeStationCount; i++) if (isStationOnline(i)) online++;

  char buf[48];
  uint16_t bg, fg;
  if (alarm >= 0) {
    snprintf(buf, sizeof(buf), "! BED %02d  %s  -  CHECK NOW", alarm + 1, alertTextEn(stations[alarm].alertCode));
    bg = C_RED; fg = C_WHITE;
  } else if (near >= 0) {
    snprintf(buf, sizeof(buf), "BED %02d  PREPARE NEXT BAG", near + 1);
    bg = C_ORANGE; fg = C_BG;
  } else {
    snprintf(buf, sizeof(buf), "ALL NORMAL   ONLINE %d/%d", online, activeStationCount);
    bg = C_CARD; fg = C_GREEN;
  }
  String line = String(buf);
  if (line == cacheBottom) return;
  cacheBottom = line;
  tft.fillRect(0, BOTBAR_Y, SCR_W, BOTBAR_H, bg);
  textCenterIn(line, 0, SCR_W, BOTBAR_Y + 5, 1, fg, bg);
}

// ---- รายการเตียงด้านขวา ----
void drawSideRow(int idx, int y, int rowH) {
  BedUiStatus st = bedUiStatus(idx);
  const StationData &s = stations[idx];
  bool dim = (st == BU_OFFLINE);
  uint16_t card = dim ? C_OFFCARD : C_CARD;
  uint16_t sc = bedColor(st);

  tft.fillRoundRect(SIDE_X, y, SIDE_W, rowH, 4, card);
  tft.fillRect(SIDE_X, y, 4, rowH, sc);

  char bed[8];
  snprintf(bed, sizeof(bed), "B%02d", idx + 1);
  String rateStr;
  if (st == BU_OFFLINE)     rateStr = "OFF";
  else if (st == BU_PAUSED) rateStr = "||";
  else                      rateStr = String((int)(s.flowRate_ml_hr + 0.5f));

  if (rowH >= 30) {
    textAt(String(bed), SIDE_X + 8, y + 5, 2, dim ? C_DIM : C_WHITE, card);
    textRight(rateStr, SIDE_X + SIDE_W - 6, y + 5, 2, bedIsAlarm(st) ? sc : (dim ? C_DIM : C_WHITE), card);
    if (st != BU_OFFLINE) drawProgressBar(SIDE_X + 8, y + rowH - 9, SIDE_W - 16, 5, bedPct(idx),
                                          (st == BU_NEAREND) ? C_ORANGE : C_CYAN);
  } else {
    textAt(String(bed), SIDE_X + 8, y + (rowH - 8) / 2, 1, dim ? C_DIM : C_WHITE, card);
    textRight(rateStr, SIDE_X + SIDE_W - 6, y + (rowH - 16) / 2, 2, bedIsAlarm(st) ? sc : (dim ? C_DIM : C_WHITE), card);
  }
}

void updateSideList(int focus, bool force) {
  int n = activeStationCount - 1;
  if (n <= 0) return;
  int gap = 4;
  int rowH = (PANEL_H - gap * (n - 1)) / n;
  if (rowH > 40) rowH = 40;
  if (rowH < 20) rowH = 20;
  if (force || rowH != uiRowsDrawn) {
    tft.fillRect(SIDE_X, PANEL_Y, SIDE_W, PANEL_H, C_BG);
    uiRowsDrawn = rowH;
    for (int i = 0; i < MAX_SUPPORTED_STATIONS; i++) cacheSide[i] = "";
  }

  int slot = 0;
  for (int i = 0; i < activeStationCount; i++) {
    if (i == focus) continue;
    BedUiStatus st = bedUiStatus(i);
    String key = String((int)st) + ":" + String((int)(stations[i].flowRate_ml_hr + 0.5f)) + ":" + String(bedPct(i));
    if (key != cacheSide[i]) {
      cacheSide[i] = key;
      drawSideRow(i, PANEL_Y + slot * (rowH + gap), rowH);
    }
    slot++;
  }
}

// ---- แผงเตียงหลักด้านซ้าย ----
void drawFocusPanel(int focus, bool force) {
  BedUiStatus st = bedUiStatus(focus);
  const StationData &s = stations[focus];
  uint16_t sc = bedColor(st);

  char head[24];
  snprintf(head, sizeof(head), "BED %02d", focus + 1);
  String headKey = String(head) + "|" + String((int)st) + "|" + String(s.cfg.patientName);
  if (force || headKey != cacheFocusHead) {
    cacheFocusHead = headKey;
    tft.fillRoundRect(PANEL_X, PANEL_Y, PANEL_W, PANEL_H, 6, C_CARD);
    tft.fillRoundRect(PANEL_X, PANEL_Y, PANEL_W, 26, 6, sc);
    tft.fillRect(PANEL_X, PANEL_Y + 18, PANEL_W, 8, sc);
    textAt(String(head), PANEL_X + 7, PANEL_Y + 6, 2, C_BG, sc);
    String name = String(s.cfg.patientName);
    if (name.length() > 14) name = name.substring(0, 14);
    textRight(name, PANEL_X + PANEL_W - 7, PANEL_Y + 8, 1, C_BG, sc);
    cacheStatusWord = ""; cacheRate = ""; cacheSetRate = ""; cacheSummary = ""; cachePct = -999;
  }

  String word = String(bedWord(st));
  if (word != cacheStatusWord) {
    cacheStatusWord = word;
    textAt(padTo(word, 9), PANEL_X + 9, 66, 2, sc, C_CARD);
  }

  String rateStr = (st == BU_OFFLINE) ? String("--") :
                   (st == BU_PAUSED)  ? String("--") : String((int)(s.flowRate_ml_hr + 0.5f));
  if (rateStr != cacheRate) {
    cacheRate = rateStr;
    tft.fillRect(PANEL_X + 9, 92, PANEL_W - 18, 48, C_CARD);
    textAt(rateStr, PANEL_X + 9, 92, 6, bedIsAlarm(st) ? sc : C_WHITE, C_CARD);
  }

