kittiphun-rut/IV-Monitor-BCNPH/firmware/ESP32-S3-Host-TFT-V_4_8_0/ESP32-S3-Host-TFT-V_4_8_0.ino
  String setStr = (s.cfg.targetRateHr > 0) ? ("SET " + String((int)(s.cfg.targetRateHr + 0.5f))) : String("SET --");
  if (setStr != cacheSetRate) {
    cacheSetRate = setStr;
    textAt("mL/h", PANEL_X + 9, 148, 1, C_DIM, C_CARD);
    textRight(padTo(setStr, 9), PANEL_X + PANEL_W - 9, 148, 1, C_SKY, C_CARD);
  }

  int pct = bedPct(focus);
  if (pct != cachePct) {
    cachePct = pct;
    drawProgressBar(PANEL_X + 9, 168, PANEL_W - 18, 12, (pct < 0) ? 0 : pct,
                    (st == BU_NEAREND) ? C_ORANGE : C_CYAN);
  }

  int left = (s.cfg.planVolumeMl > 0) ? (int)(s.cfg.planVolumeMl - s.totalVolumeMl) : -1;
  if (left < 0 && s.cfg.planVolumeMl > 0) left = 0;
  int mins = bedMinutesLeft(focus);
  char tl[16];
  if (mins >= 0) snprintf(tl, sizeof(tl), "%dh %02dm", mins / 60, mins % 60);
  else           snprintf(tl, sizeof(tl), "--h --m");
  String sum = String(pct) + "|" + String(left) + "|" + String(tl);
  if (sum != cacheSummary) {
    cacheSummary = sum;
    tft.fillRect(PANEL_X + 7, 190, PANEL_W - 14, 10, C_CARD);
    textAt(pct >= 0 ? (String(pct) + "%") : String("--"), PANEL_X + 9, 190, 1, C_DIM, C_CARD);
    textCenterIn(left >= 0 ? (String(left) + " mL") : String("-- mL"), PANEL_X, PANEL_W, 190, 1, C_WHITE, C_CARD);
    textRight(String(tl), PANEL_X + PANEL_W - 9, 190, 1, bedIsAlarm(st) ? sc : C_WHITE, C_CARD);
  }
}

// ---- หน้าหลัก ----
void drawMainFramework() {
  tft.fillScreen(C_BG);
  drawTopBarFramework();
  resetUiCaches();
}

void updateMainScreen() {
  int focus = currentFocusBed();
  bool focusChanged = (focus != uiFocusDrawn);
  uiFocusDrawn = focus;
  updateTopBar();
  drawFocusPanel(focus, focusChanged);
  updateSideList(focus, focusChanged);
  updateBottomBar();
}

// ---- จอเตือนเต็มจอ ----
void drawAlarmFramework() {
  int bed = autoFocusBed();
  if (bed < 0) bed = 0;
  const StationData &s = stations[bed];
  uint8_t code = s.alertCode;

  tft.fillScreen(C_RED);
  tft.fillRoundRect(10, 8, 300, 40, 8, C_WHITE);
  char head[24];
  snprintf(head, sizeof(head), "BED %02d", bed + 1);
  textAt(String(head), 22, 18, 3, C_RED, C_WHITE);
  String name = String(s.cfg.patientName);
  if (name.length() > 16) name = name.substring(0, 16);
  textRight(name, 298, 24, 1, C_RED, C_WHITE);

  const char* word = alertTextEn(code);
  const char* sub  = "CHECK IV SYSTEM";
  if (code == ALERT_OCCLUSION)     sub = "LINE BLOCKED - CHECK TUBING";
  else if (code == ALERT_TOO_FAST) sub = "FLOW ABOVE TARGET - ADJUST CLAMP";
  else if (code == ALERT_TOO_SLOW) sub = "FLOW BELOW TARGET - ADJUST CLAMP";
  else if (code == ALERT_COMPLETE) sub = "INFUSION FINISHED";
  textCenterIn(String(word), 0, SCR_W, 62, 4, C_WHITE, C_RED);
  textCenterIn(String(sub), 0, SCR_W, 102, 1, C_YELLOW, C_RED);

  tft.fillRoundRect(20, 122, 280, 66, 8, C_BG);
  textAt("RATE", 32, 130, 1, C_DIM, C_BG);
  textAt("mL/h", 32, 172, 1, C_DIM, C_BG);
  textRight(s.cfg.targetRateHr > 0 ? ("SET " + String((int)(s.cfg.targetRateHr + 0.5f)) + " mL/h") : String("SET --"),
            288, 172, 1, C_SKY, C_BG);
  int pct = bedPct(bed);
  textRight(pct >= 0 ? ("INFUSED " + String(pct) + "%") : String("INFUSED --"), 288, 130, 1, C_DIM, C_BG);

  tft.fillRoundRect(10, 198, 300, 32, 8, C_WHITE);
  textCenterIn("PRESS POWER = SNOOZE 2 MIN", 0, SCR_W, 208, 1, C_RED, C_WHITE);
  cacheAlarmRate = "";
}

void updateAlarmScreen() {
  int bed = autoFocusBed();
  if (bed < 0) bed = 0;
  String rate = String((int)(stations[bed].flowRate_ml_hr + 0.5f));
  if (rate == cacheAlarmRate) return;
  cacheAlarmRate = rate;
  tft.fillRect(30, 140, 180, 32, C_BG);
  textAt(rate, 32, 140, 4, C_WHITE, C_BG);
}

// ---- Screensaver: นาฬิกาใหญ่ ----
void drawSaverFramework() {
  tft.fillScreen(C_BG);
  textCenterIn("SMART IV HOST", 0, SCR_W, 24, 1, C_DIM, C_BG);
  textCenterIn("PRESS ANY BUTTON TO WAKE", 0, SCR_W, 210, 1, C_DIM, C_BG);
  cacheClock = ""; cacheBottom = "";
}

void updateSaverScreen() {
  String clockStr = getDisplayClockStr();
  if (clockStr != cacheClock) {
    cacheClock = clockStr;
    textCenterIn(clockStr, 0, SCR_W, 76, 7, C_WHITE, C_BG);
  }
  int online = 0;
  for (int i = 0; i < activeStationCount; i++) if (isStationOnline(i)) online++;
  char buf[40];
  snprintf(buf, sizeof(buf), "ONLINE %d/%d   ALL NORMAL", online, activeStationCount);
  String line = String(buf);
  if (line != cacheBottom) {
    cacheBottom = line;
    textCenterIn(line, 0, SCR_W, 156, 1, C_GREEN, C_BG);
  }
}

// ---- ตัวควบคุมการแสดงผลทั้งหมด ----
void updateHostDisplay() {
  if (displaySleeping || isPowerOffProgressActive) return;

  bool nearPending = anyNearEndPending();
  if (!screensaverActive && !globalAlarmTriggered && !nearPending &&
      (millis() - lastUserActivityTime >= SCREENSAVER_IDLE_MS)) {
    screensaverActive = true;
  }
  // มีเหตุวิกฤต (ยังไม่พักเสียง) หรือเตือนใกล้หมดที่ยังไม่รับทราบ -> ออกจาก Screensaver
  if (screensaverActive && ((globalAlarmTriggered && !isSnoozed()) || nearPending)) {
    screensaverActive = false;
  }

  int mode = UI_MODE_MAIN;
  if (screensaverActive) mode = UI_MODE_SAVER;
  else if (globalAlarmTriggered && !isSnoozed()) mode = UI_MODE_ALARM;

  if (mode != uiMode) {
    uiMode = mode;
    resetUiCaches();
    if (mode == UI_MODE_SAVER)      drawSaverFramework();
    else if (mode == UI_MODE_ALARM) drawAlarmFramework();
    else                            drawMainFramework();
  }

  if (mode == UI_MODE_SAVER)      updateSaverScreen();
  else if (mode == UI_MODE_ALARM) updateAlarmScreen();
  else                            updateMainScreen();
}

// ---- หน้าจอเฉพาะกิจ: ปิดเครื่อง / กำลังกดค้าง / หน้าจอต้อนรับ ----
void drawPowerOffProgress(int pct) {
  if (uiMode != UI_MODE_POWER) {
    uiMode = UI_MODE_POWER;
    tft.fillScreen(C_BG);
    textCenterIn("POWER OFF ?", 0, SCR_W, 70, 3, C_WHITE, C_BG);
    textCenterIn("KEEP HOLDING TO TURN OFF", 0, SCR_W, 110, 1, C_DIM, C_BG);
    tft.drawRoundRect(58, 138, 204, 24, 6, C_WHITE);
  }
  if (pct < 0) pct = 0;
  if (pct > 100) pct = 100;
  int w = (200 * pct) / 100;
  tft.fillRect(60, 140, w, 20, C_RED);
  tft.fillRect(60 + w, 140, 200 - w, 20, C_BG);
}

void drawGoodbyeScreen() {
  uiMode = UI_MODE_POWER;
  tft.fillScreen(C_BG);
  textCenterIn("GOODBYE", 0, SCR_W, 80, 4, C_SKY, C_BG);
  textCenterIn("RELEASE BUTTON TO TURN OFF", 0, SCR_W, 140, 1, C_DIM, C_BG);
  textCenterIn("HOLD 2s TO POWER ON AGAIN", 0, SCR_W, 160, 1, C_DIM, C_BG);
}

